import React from "react";
import Footer from "../components/Footer";
import Header from "../components/Header";

const Home = () => {
  return (
    <div className="page-wrapper">
      <Header title="Tzofia art" />

      <main className="home-main">
        <div className="scroll-paper">
          <p className="biblical-text">
            יש שלוש סוגים של חקר יוחסין (גנאולוגיה) בתנ"ך.
            <br></br>
            א. הראשון הוא חקר יוחסין פשוט שכתוב במפורש באחד מספרי התנ"ך (אברהם
            היה אביו של יצחק וכדו').<br></br> ב. השני הוא חקר יוחסין מחז"ל, יש
            מקרים שבתנ"ך לא כתוב על משפחתו של אדם מסויים וחז"ל (בגמרא, במדרשים,
            בזוהר ובספרי הראשונים) כן כותבים על משפחתו כגון אמא של אברהם אבינו
            או השבטים של חלק מהשופטים שכתובים רק במדרשים, במקרים כאלו יש לפעמים
            (אבל לא תמיד) ריבוי דעות אז באילן שמנו כוכבית קטנה (*) ליד שם הדמות
            במקרים של ריבוי דעות ומחלוקת. <br></br>ג. השלישי הוא חקר יוחסין
            מהבנת הפשט במקרים שאין דעה מחז"ל (לדוגמא הנביא חנני מתקופת אסא המלך
            יכול להיות אביו של הנביא יהוא בן חנני מתקופת אסא המלך), במקרים כאלה
            שמנו סימן שאלה (?) בחיבור המסופק כדי להראות את הספק. במקרים שאי אפשר
            לדעת לפי שלושת האפשרויות הדמות מחוברת גם כן לסימן שאלה (כגון גד
            הנביא). <br></br>2.לא כל דמות תנ"כית נמצאת באילן, בתנ"ך יש אלפי
            שמות, דמויות ואנשים שונים ולשים את כולם באילן יוחסין אחד זה כמעט
            בלתי אפשרי, באילן זה שמנו רק את האנשים החשובים ביותר ועדיין הגענו
            למעל 500 דמויות ושמות.<br></br> 3.השנים באילן הם למנין בריאת האדם.
            כל הזמנים והשנים באילן (למעט השנים שכתובות אצל מלכי בית שני-ראה שם)
            הם לפי ספר "סדר הדורות הקצר" לרב שלמה בניזרי שליט"א. חלק גדול
            מהחקירה (במיוחד של שלשלת הקבלה) נעשתה לפי הספר "דור דור ודורשיו" לרב
            אלקנה אליאסי זצ"ל.<br></br> 4.האילן הינו תוצאה של מחקר פרטי לצורך
            למידה בלבד ואין להסיק ממנו למעשה.
            
          </p>
        </div>
      </main>

      <Footer />
    </div>
  );
};

export default Home;
